README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-10-21 Wed 10:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />

<link rel="stylesheet" type="text/css" href="readme.css" />

</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org54a2a6e">1. Sigma16 source directory</a>
<ul>
<li><a href="#orgf8028d5">1.1. Quick start: Running Sigma16 in a web page</a></li>
<li><a href="#org97f4736">1.2. Internet links</a></li>
<li><a href="#orgdc3f781">1.3. Download and run locally</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org54a2a6e" class="outline-2">
<h2 id="org54a2a6e"><span class="section-number-2">1</span> Sigma16 source directory</h2>
<div class="outline-text-2" id="text-1">
<p>
This is the README file for the Sigma16 source directory.  Second test
version using org instead of md.
</p>

<p>
Sigma16 is a computer architecture designed for research and teaching
in computer systems.  This application provides a complete environment
for experimenting with the architecture.
</p>
</div>

<div id="outline-container-orgf8028d5" class="outline-3">
<h3 id="orgf8028d5"><span class="section-number-3">1.1</span> Quick start: Running Sigma16 in a web page</h3>
<div class="outline-text-3" id="text-1-1">
<p>
You don't need to install anything.  Just visit the [Sigma16 Home
Page](<a href="https://jtod.github.io/home/Sigma16/">https://jtod.github.io/home/Sigma16/</a>) and click the prominent
link to "Run Sigma16 in your browser".
</p>
</div>
</div>

<div id="outline-container-org97f4736" class="outline-3">
<h3 id="org97f4736"><span class="section-number-3">1.2</span> Internet links</h3>
<div class="outline-text-3" id="text-1-2">
<p>
The [Sigma16 Home Page
(<a href="https://jtod.github.io/home/Sigma16/">https://jtod.github.io/home/Sigma16/</a>)](<a href="https://jtod.github.io/home/Sigma16/">https://jtod.github.io/home/Sigma16/</a>)
contains a link to "Run Sigma16 in your browser", as well as links to
documentation, past releases, and the source repository [source
repository
(<a href="https://github.com/jtod/Sigma16/">https://github.com/jtod/Sigma16/</a>)](<a href="https://github.com/jtod/Sigma16/">https://github.com/jtod/Sigma16/</a>).
It's best to bookmark the home page, which always points to the latest
version.
</p>
</div>
</div>

<div id="outline-container-orgdc3f781" class="outline-3">
<h3 id="orgdc3f781"><span class="section-number-3">1.3</span> Download and run locally</h3>
<div class="outline-text-3" id="text-1-3">
<p>
To run the IDE (the graphical user interface) there is no need to
download or install the software: you can just <b>Click to run Sigma16
in your browser</b> in the [Sigma16 Home
Page](<a href="https://jtod.github.io/home/Sigma16/">https://jtod.github.io/home/Sigma16/</a>).
</p>

<p>
The Home Page also provides a link to download the app.  If you copy
the Sigma16 source directory onto your computer, the following links
will run it locally without any additional software installation and
without requiring further access to the Internet.  However, these
links will not work if you're reading this page on the source
repository on GitHub via the Internet.
</p>

<ul class="org-ul">
<li>[Launch from files in this directory](./app/Sigma16.html) If you
have copied this directory onto a local machine, this link will run
it.  The advantage is that you won't need access to the Internet.
However, browsers have restricted access to your file system, to
ensure security.  One consequence of this is that the <b>Select
example</b> button in the <b>Examples</b> page won't do anything.  But you
can select the text of the example with your mouse, right-click and
Copy, then Paste it into the Editor page.  It's also possible to
install Sigma16 as an app on your computer; that gets rid of the
restrictions on file access.  See the Installation section in the
User Guide.</li>

<li>[Up to the top directory](./) Show the listing of files in the
directory containing this version.</li>
</ul>

<p>
## Installing the command line tools
</p>

<p>
In addition to the basic web page version of Sigma16, there is a
collection of separate programs that can be run in a shwll from the
command line.  <b>(These are under development and will be released in
late 2020; please come back later.)</b> These programs include a
standalone version of the IDE, fast emulator, circuit simulator, and
more.  These tools provide additional functionality, faster execution,
and the ability to work without access to the Internet.
</p>

<p>
## About the software
</p>

<p>
The Sigma16 app (the integrated development environment &#x2013; i.e. the
GUI) is implemented in JavaScript, html 5, and css.  The digital
circuit is implemented in Hydra, which requires Haskell.  Additional
software tools, including a high speed emulator, are in progress and
expected to be available in late 2020.
</p>

<p>
### Author
</p>

<p>
The architecture is designed by, and the software tools are written
by, [John O'Donnell](<a href="https://jtod.github.io/index.html">https://jtod.github.io/index.html</a>).
</p>

<p>
<code>~~</code>
Email: john.t.odonnell9@gmail.com
Web: <a href="https://jtod.github.io/index.html">https://jtod.github.io/index.html</a>
<code>~~</code>
</p>

<p>
### Copyright and license
</p>

<p>
<code>~~</code>
Copyright (C) 2019, 2020 John T. O'Donnell
License: GNU GPL Version 3 or later
See Sigma16/LICENSE.txt
<code>~~</code>
</p>

<p>
Sigma16 is free software: you can redistribute it and/or modify it
under the terms of the GNU General Public License as published by the
Free Software Foundation, either version 3 of the License, or (at your
option) any later version.
</p>

<p>
Sigma16 is distributed in the hope that it will be useful, but WITHOUT
ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
FITNESS FOR A PARTICULAR PURPOSE.  See the GNU General Public License
for more details.
</p>

<p>
You should have received a copy of the GNU General Public License
along with Sigma16.  If not, see <a href="https://www.gnu.org/licenses/">https://www.gnu.org/licenses/</a>.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2020-10-21 Wed 10:53</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
